[{"title": "zimaboard2_nas_casero/zimaborad2_nas_casero", "link": "https://pabpereza.dev/blog/zimaboard2_nas_casero/zimaborad2_nas_casero", "description": "¡Oído cocina! Aquí tienes el artículo técnico definitivo sobre la ZimaBoard 2.", "pubDate": "Thu, 26 Feb 2026 00:08:11 GMT"}, {"title": "Cómo entrar en IT en 2026 - realidad, retos y oportunidades", "link": "https://pabpereza.dev/blog/entrar_en_it_2026", "description": "Descubre la realidad del sector IT en 2026, los retos para los juniors, las oportunidades más interesantes y consejos prácticos para empezar tu carrera tecnológica. Análisis de tendencias, nichos y rutas de aprendizaje con enfoque actualizado y datos reales.", "pubDate": "Thu, 26 Feb 2026 00:00:00 GMT"}, {"title": "Windows en Docker: Cómo ejecutar Windows 11 dentro de un contenedor", "link": "https://pabpereza.dev/blog/windows-en-docker-kvm", "description": "¿Ejecutar Windows completo dentro de un contenedor Docker? Suena a contradicción. Nos han enseñado que Docker es para microservicios y que, si quieres Windows, usas una máquina virtual tradicional. Pero, ¿y si te dijera que puedes desplegar un Windows 11, limpio, desechable y accesible vía web en menos de dos minutos con un simple docker compose up?", "pubDate": "Thu, 22 Jan 2026 00:00:00 GMT"}, {"title": "Apple Container - La apuesta de Apple por los contenedores nativos en macOS", "link": "https://pabpereza.dev/blog/apple_container_analisis_contenedores_macos", "description": "Apple ha dado un paso sorprendente en el mundo de los contenedores con el lanzamiento de Apple Container, una herramienta nativa para ejecutar contenedores Linux en macOS. ¿Es el comienzo del fin para Docker Desktop en Mac? Vamos a analizar la estrategia de Apple y a probar los comandos básicos de esta nueva herramienta.", "pubDate": "Thu, 15 Jan 2026 00:00:00 GMT"}, {"title": "HomeLab - Montando mi primer Rack de 10\" con Raspberry Pi (Parte 1)", "link": "https://pabpereza.dev/blog/homelab-1-rack", "description": "Hola a todos y bienvenidos. Tenía muchísimas ganas de escribir este post porque, por fin, tengo terminada la primera versión de mi rack.", "pubDate": "Tue, 06 Jan 2026 00:00:00 GMT"}, {"title": "Kubeastronaut, mi experiencia y todas las dudas", "link": "https://pabpereza.dev/blog/2025/kubeastronaut_cncf/kubeastronaut_cncf", "description": "Mi experiencia obteniendo el certificado Kubeastronaut de la CNCF, el proceso, los requisitos y resolver todas las dudas comunes", "pubDate": "Tue, 04 Nov 2025 00:00:00 GMT"}, {"title": "Depurar builds de Docker en VS Code como un profesional", "link": "https://pabpereza.dev/blog/debug_docker_build_vscode", "description": "Construir imágenes de contenedor se ha convertido en un noble arte que, sin ser milenario, ni requerir rituales complejos, si que puede llegar a ser frustrante si no damos con la tecla adecuada.", "pubDate": "Tue, 28 Oct 2025 00:00:00 GMT"}, {"title": "LocalStack, dudas comunes y cómo usarlo con terraform", "link": "https://pabpereza.dev/blog/localstack_terraform_mas_dudas", "description": "Una guía para resolver dudas comunes al usar LocalStack con Terraform y las del vídeo anterior", "pubDate": "Wed, 22 Oct 2025 00:00:00 GMT"}, {"title": "Comunidad vs La Liga: El Verdadero Duelo del Fútbol", "link": "https://pabpereza.dev/blog/comunidad_vs_la_liga", "description": "La batalla de la comunidad contra La Liga de fútbol y la libertad de la red en España.", "pubDate": "Wed, 17 Sep 2025 00:00:00 GMT"}, {"title": "Jamás confíes ciegamente en la IA, y menos para tu infraestructura", "link": "https://pabpereza.dev/blog/no_confiar_ciegamente_en_la_IA", "description": "Hace un par de semanas, un amigo me escribió frustrado por un problema que tenía en una base de datos, concretamente un MongoDB desplegado con Docker.", "pubDate": "Wed, 20 Aug 2025 00:00:00 GMT"}]