[{"title": "HomeLab - Montando mi primer Rack de 10\" con Raspberry Pi (Parte 1)", "link": "https://pabpereza.dev/blog/homelab-1-rack", "description": "Hola a todos y bienvenidos. Tenía muchísimas ganas de escribir este post porque, por fin, tengo terminada la primera versión de mi rack.", "pubDate": "Tue, 06 Jan 2026 00:00:00 GMT"}, {"title": "Kubeastronaut, mi experiencia y todas las dudas", "link": "https://pabpereza.dev/blog/2025/kubeastronaut_cncf/kubeastronaut_cncf", "description": "Mi experiencia obteniendo el certificado Kubeastronaut de la CNCF, el proceso, los requisitos y resolver todas las dudas comunes", "pubDate": "Tue, 04 Nov 2025 00:00:00 GMT"}, {"title": "Depurar builds de Docker en VS Code como un profesional", "link": "https://pabpereza.dev/blog/debug_docker_build_vscode", "description": "Construir imágenes de contenedor se ha convertido en un noble arte que, sin ser milenario, ni requerir rituales complejos, si que puede llegar a ser frustrante si no damos con la tecla adecuada.", "pubDate": "Tue, 28 Oct 2025 00:00:00 GMT"}, {"title": "LocalStack, dudas comunes y cómo usarlo con terraform", "link": "https://pabpereza.dev/blog/localstack_terraform_mas_dudas", "description": "Una guía para resolver dudas comunes al usar LocalStack con Terraform y las del vídeo anterior", "pubDate": "Wed, 22 Oct 2025 00:00:00 GMT"}, {"title": "Comunidad vs La Liga: El Verdadero Duelo del Fútbol", "link": "https://pabpereza.dev/blog/comunidad_vs_la_liga", "description": "La batalla de la comunidad contra La Liga de fútbol y la libertad de la red en España.", "pubDate": "Wed, 17 Sep 2025 00:00:00 GMT"}, {"title": "Jamás confíes ciegamente en la IA, y menos para tu infraestructura", "link": "https://pabpereza.dev/blog/no_confiar_ciegamente_en_la_IA", "description": "Hace un par de semanas, un amigo me escribió frustrado por un problema que tenía en una base de datos, concretamente un MongoDB desplegado con Docker.", "pubDate": "Wed, 20 Aug 2025 00:00:00 GMT"}, {"title": "Kubectx y Kubens: Cambia de contexto y namespace en Kubernetes fácilmente", "link": "https://pabpereza.dev/blog/kubectx_kubens_kubernetes_context", "description": "Aprende a usar Kubectx y Kubens para cambiar de contexto y namespace en Kubernetes de forma rápida y sencilla. Mejora tu flujo de trabajo con estos comandos útiles.", "pubDate": "Fri, 18 Jul 2025 00:00:00 GMT"}, {"title": "Backups de Docker", "link": "https://pabpereza.dev/blog/backups_docker", "description": "Aprende a realizar copias de seguridad de tus contenedores Docker y Kubernetes, asegurando la protección de tus datos y configuraciones.", "pubDate": "Sat, 21 Jun 2025 00:00:00 GMT"}, {"title": "Ruta DevSecOps, recomendaciones para empezar en 2025", "link": "https://pabpereza.dev/blog/ruta_devsecops_recomendaciones_2025", "description": "Ahora sí, la parte más soicitada. ¿Cómo llegar a ser un devops o devsecops en 2025? ¿Qué tecnologías aprender? ¿Qué camino seguir?", "pubDate": "Thu, 05 Jun 2025 00:00:00 GMT"}, {"title": "¿Ollama killer?, Modelos de IA en Docker Desktop", "link": "https://pabpereza.dev/blog/docker_model_ai_mcp", "description": "En este artículo, exploraremos cómo ejecutar modelos de IA como Llama o deepseek en Docker Desktop, gracias a la nueva funcionalidad de docker model.", "pubDate": "Fri, 09 May 2025 00:00:00 GMT"}]